'''
mn개의 단위 정사각형

검 혹은 흰
8 x 8 사이즈

번갈아서 칠해져야한다.
각 칸이 검과 흰 중 하나로 색칠
변 공유 시, 다른 색으로 칠해

이 경우 두 가지만 존재, 맨 오른쪽 위가 흰 또는 검

다시 칠해야하는 최소 갯수

2개 존재

'''

# =============================================================================
# 
# =============================================================================
n, m = map(int, input().split())

arr = []
for i in range(n):
    arr.append(list(str(input())))

# =============================================================================
# 8x8으로 자른다.
# =============================================================================
# 첫째줄부터 쭉....
# 한 라인 치우고 한칸씩 내려가기
# 템플릿으로 두번 평가

templete_1 = [["W","B","W","B","W","B","W","B"],
      ["B","W","B","W","B","W","B","W"],
      ["W","B","W","B","W","B","W","B"],
      ["B","W","B","W","B","W","B","W"],
      ["W","B","W","B","W","B","W","B"],
      ["B","W","B","W","B","W","B","W"],
      ["W","B","W","B","W","B","W","B"],
      ["B","W","B","W","B","W","B","W"]]

templete_2 = [["B","W","B","W","B","W","B","W"],
      ["W","B","W","B","W","B","W","B"],
      ["B","W","B","W","B","W","B","W"],
      ["W","B","W","B","W","B","W","B"],
      ["B","W","B","W","B","W","B","W"],
      ["W","B","W","B","W","B","W","B"],
      ["B","W","B","W","B","W","B","W"],
      ["W","B","W","B","W","B","W","B"]]

tem = [templete_1, templete_2]
answer = 1000000000

for i in range(0, len(arr)-8 + 1):
    for j in range(0, len(arr[0])-8 + 1): # 사각형 8x8 잡기
        
        for templete in tem:
            ans = 0 # 점수 매 회차마다 초기화
            for dx in range(8):
                for dy in range(8):
                    # print(dx, dy)
                    nx = i + dx
                    ny = j + dy
                    if templete[dx][dy] != arr[nx][ny]:
                        ans += 1
            answer = min(answer, ans)

print(answer)
                
                
                
                
                
                
    
    
    